import type { DeepPartial } from "../DeepPartial";
import type { Translation } from "../i18n-types";

const megaphone: DeepPartial<Translation["megaphone"]> = {
    modal: {
        backToSelectCommunication: "Назад до вибору способу зв'язку",
        title: "Повідомлення для всіх",
        liveMessage: {
            startMegaphone: "Увімкнути мегафон",
            stopMegaphone: "Вимкнути мегафон",
            goingToStream: "Ви транслюватимете",
            yourMicrophone: "свій мікрофон",
            yourCamera: "свою камеру",
            yourScreen: "свій екран",
            title: "Мегафон",
            button: "Почати пряме звернення",
            and: "і",
            toAll: "усім учасникам",
            notice: `
            Пряме звернення, або «Мегафон», дає змогу звернутися наживо через камеру й мікрофон до всіх, хто зараз у кімнаті чи у світі.

            Звернення з'явиться в нижньому куті екрана, як відеодзвінок або бульбашка розмови.

            Приклад прямого звернення: «Привіт усім, починаємо конференцію? 🎉 Ідіть за моїм аватаром до зони конференції й відкрийте відеозастосунок 🚀»
            `,
            settings: "Налаштування",
        },
        textMessage: {
            title: "Текстове повідомлення",
            notice: `
            Текстове повідомлення дає змогу написати всім, хто зараз у кімнаті чи у світі.

            Повідомлення з'явиться у спливному вікні вгорі сторінки разом зі звуковим сигналом, щоб його точно помітили.

            Приклад повідомлення: «Конференція в кімнаті 3 почнеться за 2 хвилини 🎉. Можна йти до зони конференції 3 і відкривати відеозастосунок 🚀»
            `,
            button: "Надіслати текстове повідомлення",
            noAccess: "У вас немає доступу до цієї функції 😱 Зверніться до адміністратора 🙏",
        },
        audioMessage: {
            title: "Аудіоповідомлення",
            notice: `
            Аудіоповідомлення — це звуковий файл («MP3, OGG...»), який надсилається всім, хто зараз у кімнаті чи у світі.

            Усі, хто отримає це сповіщення, автоматично завантажать і прослухають аудіо.

            Наприклад, аудіоповідомленням може бути запис про те, що конференція почнеться за кілька хвилин.
            `,
            button: "Надіслати аудіоповідомлення",
            noAccess: "У вас немає доступу до цієї функції 😱 Зверніться до адміністратора 🙏",
        },
    },
};

export default megaphone;
